let dataSet = [
    [ "ناصر خلیلی", "معمار سیستم", "تهران", "61", "1400/04/25", "320,800" ],
    [ "کیوان رجبی", "حسابدار", "قم", "63", "1398/07/25", "170,750" ],
    [ "آشا حمیدی", "نویسنده متون فنی", "اراک", "66", "1399/01/12", "86,000" ],
    [ "کتایون عبدی", "توسعه دهنده", "تهران", "22", "131396/03/29", "433,060" ],
    [ "امیر رجبی", "حسابدار", "قم", "33", "1395/11/28", "162,700" ],
    [ "بهرام احمدی", "متخصص Integration", "شیراز", "61", "1396/12/02", "372,000" ],
    [ "هادی خلیلی", "دستیار فروش", "اراک", "59", "1396/08/06", "137,500" ],
    [ "رها پارسا", "متخصص Integration", "قم", "55", "1394/10/14", "327,900" ],
    [ "کیانوش زاکانی", "توسعه دهنده", "اراک", "39", "1399/09/15", "205,500" ],
    [ "نیما اکبری", "مهندس نرم افزار", "تهران", "23", "1395/12/13", "103,600" ],
    [ "جانان احدی", "مدیر دفتر", "اصفهان", "30", "1395/12/19", "90,560" ],
    [ "زهرا یوسفی", "مسئول  پشتیبانی", "تهران", "22", "1398/03/03", "342,000" ],
    [ "سعید حیدری", "مدیر منطقه ای ", "اراک", "36", "1395/10/16", "470,600" ],
    [ "هلن حسنی", "طراح ارشد بازاریابی", "اصفهان", "43", "1396/12/18", "313,500" ],
    [ "تینا اربابی", "مدیر منطقه ای ", "اصفهان", "19", "1394/03/17", "385,750" ],
    [ "مهدی حسینی", "طراح بازاریابی", "اصفهان", "66", "1396/11/27", "198,500" ],
    [ "نیما خانی", " مدیر ارشد مالی ", "شیراز", "64", "1394/06/09", "725,000" ],
    [ "گلاره لهراسبی", "مدیر سیستم", "شیراز", "54", "1399/04/10", "237,500" ],
    [ "بردیا کبیری", "مهندس نرم افزار", "اصفهان", "41", "1396/10/13", "132,000" ],
    [ "دیبا رضایی", "سرپرست بخش", "تهران", "35", "1396/09/26", "217,500" ],
    [ "ساعد پارسایی", "سرپرست توسعه نرم افزار", "شیراز", "30", "1398/09/03", "345,000" ],
    [ "یلدا  هدایتی", "مدیر ارشد بازاریابی ", "شیراز", "40", "1399/06/25", "675,000" ],
    [ "کسرا محرابی", " پشتیبانی پیش فروش", "شیراز", "21", "1398/12/12", "106,450" ],
    [ "درسا وزیری", "دستیار فروش", "کاشان", "23", "1394/09/20", "85,600" ],
    [ "آلا رفیعی", "مدیر عامل", "اصفهان", "47", "1399/10/09", "1,200,000" ],
    [ "جابر رنجبر", "توسعه دهنده", "تهران", "32", "1394/12/22", "92,575" ],
    [ "جیدا شیری", "مدیر منطقه ای ", "کرمان", "28", "1394/11/14", "357,650" ],
    [ "بهروز برهانی", "مهندس نرم افزار", "اراک", "28", "1398/06/07", "206,850" ],
    [ "فریبا عبدلی", "مدیر عامل ", "اراک", "48", "1394/03/11", "850,000" ],
    [ "شیوا مدیری", "بازاریابی منطقه ای ", "قم", "20", "1398/08/14", "163,000" ],
    [ "محمد لطفی", "متخصص Integration", "کاشان", "37", "1398/06/02", "95,400" ],
    [ "سهراب پاکزاد", "توسعه دهنده", "اصفهان", "58", "1399/10/22", "114,500" ],
    [ "ایمان راد", "نویسنده فنی", "اصفهان", "28", "1398/05/07", "145,000" ],
    [ "جمشید سعیدی", "رهبر تیم", "اراک", "32", "1395/10/26", "235,500" ],
    [ "رضا صوفی", "پشتیبانی پس از فروش", "تهران", "46", "1398/03/09", "324,050" ],
    [ "امید رحیمی", "طراح بازاریابی", "اراک", "47", "1399/12/09", "85,675" ]
];




(function($) {
    "use strict"
    //example 1
    var table = $('#example').DataTable({
        language: {
            url: './js/dataTables.fa.json'
        },
        createdRow: function ( row, data, index ) {
           $(row).addClass('selected')
        } 
    });
      
    table.on('click', 'tbody tr', function() {
    var $row = table.row(this).nodes().to$();
    var hasClass = $row.hasClass('selected');
    if (hasClass) {
        $row.removeClass('selected')
    } else {
        $row.addClass('selected')
    }
    })
    
    table.rows().every(function() {
    this.nodes().to$().removeClass('selected')
    });



    //example 2
    var table2 = $('#example2').DataTable( {
        language: {
            url: './js/dataTables.fa.json'
        },
        createdRow: function ( row, data, index ) {
            $(row).addClass('selected')
        },

        "scrollY":        "42vh",
        "scrollCollapse": true,
        "paging":         false
    });

    table2.on('click', 'tbody tr', function() {
        var $row = table2.row(this).nodes().to$();
        var hasClass = $row.hasClass('selected');
        if (hasClass) {
            $row.removeClass('selected')
        } else {
            $row.addClass('selected')
        }
    })
        
    table2.rows().every(function() {
        this.nodes().to$().removeClass('selected')
    });
	
	// 
	var table = $('#example3, #example4, #example5').DataTable({
        language: {
            url: './js/dataTables.fa.json'
        },
    });
	$('#example tbody').on('click', 'tr', function () {
		var data = table.row( this ).data();
	});
    
    jQuery('.dataTables_wrapper select').selectpicker();
   
})(jQuery);